nxp-mcuxpresso/mcux-sdk-examples/frdmk22f/demo_apps/ecompass_peripheral/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTE1 (number 2), DEBUG_UART_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_RX_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                       /* @} */

/*! @name PORTE0 (number 1), DEBUG_UART_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_TX_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB2 (number 37), ACCEL_SCL
  @{ */
#define BOARD_I2C_ACCEL_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_I2C_ACCEL_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                       /* @} */

/*! @name PORTB3 (number 38), ACCEL_SDA
  @{ */
#define BOARD_I2C_ACCEL_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_I2C_ACCEL_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

/*! @name PORTB2 (number 37), ACCEL_SCL
  @{ */
#define BOARD_GPIO_ACCEL_SCL_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_GPIO_ACCEL_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_GPIO_ACCEL_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                        /* @} */

/*! @name PORTB3 (number 38), ACCEL_SDA
  @{ */
#define BOARD_GPIO_ACCEL_SDA_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_GPIO_ACCEL_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_GPIO_ACCEL_SDA_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_GPIO_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
